INSERT INTO zt_deploy(`id`, `name`, `desc`, `status`, `owner`, `members`, `notify`, `cases`, `createdBy`, `result`, `deleted`)
  VALUES ('1', '计划1', '', 'wait', '', '', '', '', 'admin', '', '0'), 
         ('2', '计划2', '', 'wait', '', '', '', '', 'admin', '', '0'), 
         ('3', '计划3', '', 'wait', '', '', '', '', 'admin', '', '0'), 
         ('4', '计划4', '', 'done', '', '', '', '', 'admin', '', '0'), 
         ('5', '计划5', '', 'wait', '', '', '', '', 'admin', '', '1'), 
         ('6', '计划6', '', 'wait', '', '', '', '', 'admin', '', '0'), 
         ('7', '计划7', '', 'wait', '', '', '', '', 'admin', '', '0'), 
         ('8', '计划8', '', 'done', '', '', '', '', 'admin', '', '0'), 
         ('9', '计划9', '', 'wait', '', '', '', '', 'admin', '', '0'), 
         ('10', '计划10', '', 'wait', '', '', '', '', 'admin', '', '1'); 
